<details ><summary>plan for talos-bootstrap 2025-07-20 02:37:27 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project vaughnw128/immanent-grove#talos-bootstrap has been locked by PR #75
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      ~ id                      = "local:iso/talos-nocloud-amd64.img" -> (known after apply)
      ~ size                    = 2356150272 -> (known after apply)
      ~ url                     = "https://factory.talos.dev/image/84f66f3fa52900a0234636ae1da07d5b356cce774673951af35866142158fce6/v1.10.5/nocloud-amd64.raw.zst" -> "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-1"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "100" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:E5:D0:85",
        ] -> (known after apply)
        name                    = "talos-controlplane-1"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 100 -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-100-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:E5:D0:85" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>